export type spks =
  | "七七"
  | "丽莎"
  | "久岐忍"
  | "九条裟罗"
  | "云堇"
  | "五郎"
  | "优菈"
  | "八重神子"
  | "凝光"
  | "凯亚"
  | "凯瑟琳"
  | "刻晴"
  | "北斗"
  | "可莉"
  | "坎蒂丝"
  | "埃洛伊"
  | "多莉"
  | "夜兰"
  | "大慈树王"
  | "女高音_M4_1"
  | "女高音_M4_2"
  | "女高音_M4_3"
  | "妮露"
  | "安柏"
  | "宵宫"
  | "戴因斯雷布"
  | "托马"
  | "提纳里"
  | "早柚"
  | "枫原万叶"
  | "柯莱"
  | "派蒙"
  | "流浪者"
  | "温迪"
  | "烟绯"
  | "牛夫人"
  | "珊瑚宫心海"
  | "珐露珊"
  | "班尼特"
  | "琴"
  | "瑶瑶"
  | "甘雨"
  | "申鹤"
  | "男高音_M4_1"
  | "男高音_M4_2"
  | "男高音_M4_3"
  | "男高音_M4_4"
  | "男高音_M4_5"
  | "男高音_M4_6"
  | "男高音_M4_7"
  | "留云借风真君"
  | "砂糖"
  | "神里绫人"
  | "神里绫华"
  | "空"
  | "米卡"
  | "纳西妲"
  | "罗莎莉亚"
  | "胡桃"
  | "艾尔海森"
  | "艾莉丝"
  | "芭芭拉"
  | "荒泷一斗"
  | "荧"
  | "莫娜"
  | "莱依拉"
  | "莺儿"
  | "菲谢尔"
  | "萍姥姥"
  | "蒂玛乌斯"
  | "行秋"
  | "诺艾尔"
  | "赛诺"
  | "辛焱"
  | "达达利亚"
  | "迪卢克"
  | "迪奥娜"
  | "迪娜泽黛"
  | "迪希雅"
  | "重云"
  | "钟离"
  | "阿扎尔"
  | "阿贝多"
  | "雷泽"
  | "雷电将军"
  | "香菱"
  | "魈"
  | "鹿野院平藏"
  | "opencpop"
  | "一平"
  | "一心传名刀"
  | "丽塔"
  | "九条镰治"
  | "云墨丹心"
  | "人之律者"
  | "伊利亚斯"
  | "伊甸"
  | "伏特加女孩"
  | "元素女孩-琪亚娜"
  | "八重樱"
  | "八重霞"
  | "博士"
  | "卡莲"
  | "卡萝尔"
  | "哲平"
  | "夏彦"
  | "大肉丸"
  | "天元骑英"
  | "天叔"
  | "天穹游侠"
  | "失落迷迭"
  | "奥兹"
  | "奥拉夫"
  | "女士"
  | "姬子"
  | "左然"
  | "布洛妮娅"
  | "希儿"
  | "帕朵菲莉丝"
  | "常九爷"
  | "幽兰黛尔"
  | "式大将"
  | "德丽莎"
  | "拉赫曼"
  | "掇星攫辰天君"
  | "昆钧"
  | "暮光骑士"
  | "月下初拥"
  | "朔夜观星"
  | "李素裳"
  | "杜拉夫"
  | "极地战刃"
  | "格蕾修"
  | "梅比乌斯"
  | "次生银翼"
  | "海芭夏"
  | "渡鸦"
  | "爱莉希雅"
  | "爱衣"
  | "狂热蓝调"
  | "玛乔丽"
  | "玛格丽特"
  | "理之律者"
  | "琪亚娜"
  | "田铁嘴"
  | "白术"
  | "知易"
  | "空之律者"
  | "符华"
  | "第六夜想曲"
  | "维尔薇"
  | "缭乱星棘"
  | "羽生田千鹤"
  | "艾伯特"
  | "芽衣"
  | "莉莉娅"
  | "莫弈"
  | "菲尔戈黛特"
  | "萝莎莉娅"
  | "薪炎之律者"
  | "识之律者"
  | "迷城骇兔"
  | "阿晃"
  | "阿波尼亚"
  | "雷之律者"
  | "魇夜星渊"
  | "黑希儿";

export const spk_list = {
  "svc.baimianxiao.cn": [
    "opencpop",
    "一平",
    "一心传名刀",
    "七七",
    "丽塔",
    "丽莎",
    "久岐忍",
    "九条裟罗",
    "九条镰治",
    "云堇",
    "云墨丹心",
    "五郎",
    "人之律者",
    "伊利亚斯",
    "伊甸",
    "伏特加女孩",
    "优菈",
    "元素女孩-琪亚娜",
    "八重樱",
    "八重神子",
    "八重霞",
    "凝光",
    "凯亚",
    "凯瑟琳",
    "刻晴",
    "北斗",
    "博士",
    "卡莲",
    "卡萝尔",
    "可莉",
    "哲平",
    "坎蒂丝",
    "埃洛伊",
    "夏彦",
    "多莉",
    "夜兰",
    "大慈树王",
    "大肉丸",
    "天元骑英",
    "天叔",
    "天穹游侠",
    "失落迷迭",
    "奥兹",
    "奥拉夫",
    "女士",
    "妮露",
    "姬子",
    "安柏",
    "宵宫",
    "左然",
    "布洛妮娅",
    "希儿",
    "帕朵菲莉丝",
    "常九爷",
    "幽兰黛尔",
    "式大将",
    "德丽莎",
    "戴因斯雷布",
    "托马",
    "拉赫曼",
    "掇星攫辰天君",
    "提纳里",
    "早柚",
    "昆钧",
    "暮光骑士",
    "月下初拥",
    "朔夜观星",
    "李素裳",
    "杜拉夫",
    "极地战刃",
    "枫原万叶",
    "柯莱",
    "格蕾修",
    "梅比乌斯",
    "次生银翼",
    "派蒙",
    "流浪者",
    "海芭夏",
    "渡鸦",
    "温迪",
    "烟绯",
    "爱莉希雅",
    "爱衣",
    "狂热蓝调",
    "玛乔丽",
    "玛格丽特",
    "珊瑚宫心海",
    "珐露珊",
    "班尼特",
    "理之律者",
    "琪亚娜",
    "琴",
    "瑶瑶",
    "甘雨",
    "田铁嘴",
    "申鹤",
    "留云借风真君",
    "白术",
    "知易",
    "砂糖",
    "神里绫人",
    "神里绫华",
    "空",
    "空之律者",
    "符华",
    "第六夜想曲",
    "纳西妲",
    "维尔薇",
    "缭乱星棘",
    "罗莎莉亚",
    "羽生田千鹤",
    "胡桃",
    "艾伯特",
    "艾尔海森",
    "芭芭拉",
    "芽衣",
    "荒泷一斗",
    "荧",
    "莉莉娅",
    "莫娜",
    "莫弈",
    "莱依拉",
    "菲尔戈黛特",
    "菲谢尔",
    "萍姥姥",
    "萝莎莉娅",
    "薪炎之律者",
    "行秋",
    "识之律者",
    "诺艾尔",
    "赛诺",
    "辛焱",
    "达达利亚",
    "迪卢克",
    "迪奥娜",
    "迪娜泽黛",
    "迪希雅",
    "迷城骇兔",
    "重云",
    "钟离",
    "阿扎尔",
    "阿晃",
    "阿波尼亚",
    "阿贝多",
    "雷之律者",
    "雷泽",
    "雷电将军",
    "香菱",
    "魇夜星渊",
    "魈",
    "鹿野院平藏",
    "黑希儿",
  ],
  "svc.ai-lab.top": [
    "七七",
    "丽莎",
    "久岐忍",
    "九条裟罗",
    "云堇",
    "五郎",
    "优菈",
    "八重神子",
    "凝光",
    "凯亚",
    "凯瑟琳",
    "刻晴",
    "北斗",
    "可莉",
    "坎蒂丝",
    "埃洛伊",
    "多莉",
    "夜兰",
    "大慈树王",
    "女高音_M4_1",
    "女高音_M4_2",
    "女高音_M4_3",
    "妮露",
    "安柏",
    "宵宫",
    "戴因斯雷布",
    "托马",
    "提纳里",
    "早柚",
    "枫原万叶",
    "柯莱",
    "派蒙",
    "流浪者",
    "温迪",
    "烟绯",
    "牛夫人",
    "珊瑚宫心海",
    "珐露珊",
    "班尼特",
    "琴",
    "瑶瑶",
    "甘雨",
    "申鹤",
    "男高音_M4_1",
    "男高音_M4_2",
    "男高音_M4_3",
    "男高音_M4_4",
    "男高音_M4_5",
    "男高音_M4_6",
    "男高音_M4_7",
    "留云借风真君",
    "砂糖",
    "神里绫人",
    "神里绫华",
    "空",
    "米卡",
    "纳西妲",
    "罗莎莉亚",
    "胡桃",
    "艾尔海森",
    "艾莉丝",
    "芭芭拉",
    "荒泷一斗",
    "荧",
    "莫娜",
    "莱依拉",
    "莺儿",
    "菲谢尔",
    "萍姥姥",
    "蒂玛乌斯",
    "行秋",
    "诺艾尔",
    "赛诺",
    "辛焱",
    "达达利亚",
    "迪卢克",
    "迪奥娜",
    "迪娜泽黛",
    "迪希雅",
    "重云",
    "钟离",
    "阿扎尔",
    "阿贝多",
    "雷泽",
    "雷电将军",
    "香菱",
    "魈",
    "鹿野院平藏",
  ],
};
